# coding: utf-8
# __author__: u"John"
from __future__ import unicode_literals, print_function, division
from mplib.common import smart_decode, smart_encode
import traceback
import sys
import re


def mother_baby_denoise(text, vocab):
    if len(text) == 0:
        noise_type = "无法识别"
    elif len(text) == 1:
        noise_type = "单字"
    elif len(text) > 500:
        noise_type = "超长帖"
    else:
        noise_type = "|".join([tag[0] for tag in vocab if re.findall(re.compile(tag[1]), text)])
        if not noise_type:
            noise_type = "0"
    return noise_type

id = ""
channel = ""
subject = ""
post_id = ""
title = ""
tags = ""
reply_count = ""
view_count = ""
collection_count = ""
detail_url = ""
content = ""
is_best_answer = ""
like_count = ""
user_id = ""
user_name = ""
user_type = ""
is_host = ""
replied_user_id = ""
replied_user_name = ""
created_at = ""
device = ""
updated_at = ""
baby_agethen = ""
baby_days = ""
floorid = ""
noise = ""
platform_id = ""


l = [
    ("广告", "(本|此|这)(品|药|店|疗法|款)|配制|最好的选择|看(的|得)到(的)*效果|是\D{0,3}家喻户晓的|由祖传秘方|安全有效|秘制|温馨提示|适合你|代理|\#\d*\W*\d*\W*\d*\#|即刻预约|接受电话预定|赶快行动|微信关注|新品推荐会|盛大开业|给力的促销|折封顶|是\D{0,3}家喻户晓的|率先引进|盛装启幕|强烈推荐|福音|领跑|尊敬会员|专属|100%放心|拉开帷幕|放心使用|独家播报|新品发布|精选优质的|美国进口|专为孕妇|试听地址|放心享用|肌肤|销量桂冠|尊敬的会员|天猫旗舰店|值得拥有|打广告|推广网|试客联盟|全面推出|新品抢鲜|抢货|免单|不容错过|尽显运动风范|效果不满意|友情推荐|首次引入|咨询热线|千元大礼包|备货首选|均赠送价值|现在购买|质量有保证|共同赞助|由\D{0,10}主办|当天新注册会员|赶快来应征"),
    ("代购售货", "预订|询价|在线QQ|代购|澳洲销售|包邮|有意电联|联系人|正品|直邮|微信关注|全新未拆封|微信号(:|：)*\d+|(咨询|QQ|qq|微信|全文|链接|优惠|适合人群|电话|关注|微信号|群号|群)(\：|\:)|官网查询|购买(地址|链接)|(来|断|现)货|(Vv微wei)(信商)|有折扣|质量杠杠|新款来袭|白菜价|累计购物满|限时抢购|最后出清|微信号(:：)*d+|正品现货|有意者咨询|限时折扣|支持各种形式验货|支持验货|售完无货|数量有限|一口价|促销价|买即送|更多精彩请加微信|价格超低|有意者联系|正品来袭|全国包邮|外贸尾单|正品换季|购买(地址链接)|201年(新款新品)|订购热线|喜欢的微我|下单速度|手慢无|手快有|活动感恩价|原单新款|原单真品|代理价|本店仅|外贸原单|官网同步|点击进入地址|全场.*折起|2013批发|请看下图|(来|断|现)货|全网最低|运费自理|抢鲜上市|需要私信|批发|微店|今日上线|热款推荐|需要的朋友联系我|代理|请点击登陆|最新潮爆|流行前线|一站式采购|货源充足|长期供货|欢迎主推|批发价格|原单|现货|有需要联系|新品特价|工厂直销|价格优惠|买就送|送完为止|新货上架|新货到|欢迎到店|厂价直销|进店即可|精美礼品一份|以独特的设计|上乘的品质|发货|小伙伴们快去|微店首页|欢迎新老顾客|厂家批发|现特价|需要的朋友留言|退款|恭候您的光临|明星同款|友情价|请致电|热卖中|https://item.taobao.com/|热销中|有兴趣的私聊|支持支付宝付款|联系方式|直邮单价|速度与我联系|全面回货|清货|厂家直销|尾货批发|赶快行动吧|有要的，联系我|新出的新款|欢迎大家选购|欢迎选购|批发价格优惠|夏日外出必备|惊喜价格|欢迎咨询|价格最优|加微信|仅限今日|欢迎订购|请加店主微信|本店联系电话|请加微信|限时秒杀|预定|前来选购|免邮|快来看看吧|包省内顺丰|顺丰包邮|转让|为了回馈新老客户|喜欢的一定不要错过|购买地址是|品牌折扣店|正式开业|转卖|收藏有礼|有需要的私我|仅此一天|详询|惊喜尝鲜价|建议点击大图|赠品|新品报道|欢迎进店选购|欢迎进店|更多精彩，尽在|丰厚礼品相送|全场买一赠一|店内公告|请认准|安全有效|欢迎您的光临|分享自微店|限时价|秘制|欢迎广大|包顺丰|新款推荐|新款到|特价新品|详情:|喜欢点这里|产品推荐|精品推荐|欢迎大家来选购|批发招代理|要的速度联系|喜欢的抓紧|独家正版|独家新款|胶囊\D{0,3}粒|更多新款请关注|请关注我们微信号|韩版潮款|速度联系|下单立减|介绍给你的朋友|诚招代理|库存全清|售价|最近销量|分享自微淘|数量不多，先到先得|大家抓紧啦|及时付款|打包发货|倒贴运费|温馨提示|请询价|喜欢戳这里|寒冬必入|补货到|已经上架|上架|喜欢的可以上我们|货到|新款|有货|热销|问价|专柜正品|到货|爆款|五钻|微卖|男款|特价|商品|专场|专柜|回馈中|总店|便宜转|新品上线|货源|赶紧行动|请猛点|部分新品|买衣送衣|特惠|天猫特价|亏本只卖|吐血价|跳楼价|诚招有经验代理|新品到店|链接|新貨上市|抓紧预定|元礼品卡|折起预定|想看细节图的微我|小店新开张|大家多多支持|支付宝邮寄|全国货到付款|客服电话|订购电话|淘宝商城特价|新品速递|新品播报|限量款|点我购买|购买详情|详情链接|直达链接|超值体验|新品上架|购买链接|店内有售|绝对超值|报名从速|求扩散|选尺寸|新品上市|详情信息|订购链接|分享地址|尺码齐全|参考地址|淘宝网址|新品预览|抢先加购物车|新店开张|更多精彩|关注微信|转发返现|靓品推荐|欢迎预定|限量供应|超级限量 |绝对的好质量|可以预定了|即将上架|现在穿正合适|超级限量|喜欢的朋友|直接进入本店|微博专享|有需要的联系我|有兴趣和我联系|如假包退|店铺链接|链接见评论|本期主推|快入手|此款式|货真价实|请点击|强货来袭|同步上市|人家人爱|接受预定|去淘宝搜|有要的找我|qq群|好价格|最新出货|喜欢的私聊|识货来付|出货|新上架|补货|开售|男女童装|海淘拼单|童装团购|有意者加我|有需要的加|加绒款式|数量不多|抓紧时间购买|做微商|下单预定|过后不接单|码数齐全|有优惠|放心购买|开了一个店铺|多多捧场|套装组合|邮费自理|全额退|不退换|谨慎下单|补到补到|速度下单|下单赶紧|质量保证|价格亲民|亲自进货|淘宝优惠价|可以私聊|活动价|亲自发货|预定款|联系卖家|发链接|发顺丰|停止发货|亲速度|百分百纯棉|自助下单|欢迎下单|下单订购|童装批发|预定中|一起发货|全部码数|顺丰到付|100\%实拍|新开的淘宝|正式上架|上架发售|本季产品|即将到店|爆版补到|百搭实用款|人人必入|国内运费|牛仔裤有售|最后\w{0,1}件|欢迎光顾|独家实拍|可拼单|适合\w{0,1}穿|独家订制|超级爆|活动\w{0,1}划算|套装款|最高品质|v信|近期售出|百搭款|镇店款|搭配单品|部分款式|加微xin|小铺开业|店铺网址|好礼送给你|可以优惠|轻轻松松就领到|20\w{0,2}童装|20\w{0,4}款|有意请加微|帮忙多多宣传|折款|现在很优惠|店\w{0,1}开业|正在发红包|随机发货|开业大酬宾|配全套包装发票|联系微信|微信联系|零售与批发|小伙伴们都抢疯了|装批发|可以私我|店开业|活动抓紧时间|活动+截止|注意查收|准时开拍|童装专卖|火热上市|还不赶紧带上|实拍图无P|进入店铺|查看更多宝贝|购买\w{0,1}送|跑量款|供你选择|outlets直播|订单截止|猛戳这里|双11+优惠|价格+优惠|欢迎大家光临|主营：|更多优惠|点此查看|产品速递|为了答谢+支持|有奖转发|香港代購|产品介绍|新品推荐|预购从速|微信联系我|值得拥有的|超值划算|首批货|有意向可以联系我|店长\D{0,5}推荐|同款|已到店|购买地址|淘宝链接：|亲可以拍下|款号：|购入地址：|欲购请|天猫店上新|是您的首选|热卖单品|抽奖次数越多|授权经销商|调换或退款|新品预告|支持货到付款|欢迎来店选购|任你选|转闲置|二手闲置|优惠价|男女同款|淘宝只卖|甩卖价|天猫商城价|现价只有|最终售价|感恩节折扣|即可获得优惠|新品预售|双十一狂欢价|甩卖|开抢|快来抢|更多优惠活动等着你|全清价|每件立减|0元换购|精选上市|大减价|大处理|清场甩|优惠等你来|喜迎双11|限时\w{0,1}折|大销价|购实惠|购满+送|送+价值|开学巨献|开业价|全场\w{0,3}折|满\w{0,3}减|件W{0,3}折|全场\w{0,2}减|买\w{0,2}减|折处理|折优惠|元优惠券|包顺风|送.*元红包|分享有礼送|一大波.*来袭|买\D{0,5}送|低至\w{0,5}折|买1送1|买一送一|风衣特价|买任意款|加100元换购|加1元送一|码特价|热销价|折扣价|疯狂价|如果您不满意|赶紧转发吧|咨询店铺|转二手|过冬必备|淘宝热卖价|特价折扣|仅售|超低折扣|无数好评|新品|赶紧入手|中秋送礼|为您精心准备了|先下手为强|亚马逊链接|反季清仓|详情请见|敬请光临|20(\d){1,2}(春|夏|秋|冬)(春|夏|秋|冬)(新|爆)(款|品)|(春|夏|秋|冬)(春|夏|秋|冬)新品培训|(春|夏|秋|冬)装开始上市|(春|夏|秋|冬)季酬宾会|(秋冬|春夏|秋季|春季|冬季|夏季)\D{0,2}(发布会|期货会|订货会)|(春|夏|秋|冬)款上(柜|市)|礼品新春任性送|(春|夏|秋|冬)季热卖|(春|夏|秋|冬)日外出必备|(春|夏|秋|冬)(春|夏|秋|冬)第(一|二|三|四)波|20(\d){1,2}(春|夏|秋|冬)(春|夏|秋|冬)搭配|(春|夏|秋|冬)装折扣款|(春|夏|秋|冬)(春|夏|秋|冬)(必备|热卖)"),
    ("促销", "预售|反季清仓|促销活动|大促销|试用装|赶紧行动|选购|赠品|热销|特价|限时|批发|大型展卖|促销商品|折上折|特价场|还在等什么|活动品牌|全场品牌|需要的抓紧|优惠劵大放送|体验价|优惠多多|购物狂欢节|限时优惠|特价处理|清仓|断码|原价|降价|打折|限时|低价|特卖|满购|聚划算|购物满|促销|优惠价|男女同款|淘宝只卖|甩卖价|天猫商城价|现价只有|最终售价|感恩节折扣|即可获得优惠|新品预售|双十一狂欢价|甩卖|开抢|快来抢|更多优惠活动等着你|全清价|每件立减|0元换购|精选上市|大减价|大处理|清场甩|优惠等你来|喜迎双11|限时\w{0,1}折|大销价|购实惠|购满+送|送+价值|开学巨献|开业价|全场\w{0,3}折|满\w{0,3}减|件W{0,3}折|全场\w{0,2}减|买\w{0,2}减|折处理|折优惠|元优惠券|包顺风|送.*元红包|分享有礼送|一大波.*来袭|买\D{0,5}送|低至\w{0,5}折|买1送1|买一送一|风衣特价|买任意款|加100元换购|加1元送一|码特价|热销价|折扣价|疯狂价|优惠价|男女同款|淘宝只卖|甩卖价|天猫商城价|现价只有|最终售价|感恩节折扣|即可获得优惠|新品预售|双十一狂欢价|甩卖|开抢|快来抢|更多优惠活动等着你|全清价|每件立减|0元换购|精选上市|大减价|大处理|清场甩|优惠等你来|喜迎双11|特价折扣|抢购|商场特卖|国庆特惠|购物节|活动时间|(春|夏|秋|冬)装折扣"),
    ("投票活动", "\【|\】|\〖|\〗|\《|\》|我是雷锋|帮忙投票|好礼等你来拿|活动推荐给大家|活动详见|有机会赢|有奖竞猜|详情(请)*点击|活动热线|现在就来参加|只要分享|就有机会获得|微博抽奖|获得好礼|即可赢得|有机会获得|获奖名单|就有机会中奖|赢取|即可获赠|礼品等着您|圆满落幕|有机会赢得|报名活动|幸运奖品|诚邀您参与|有奖活动|的大力支持|快来报名吧|火热报名中|狂欢季|活动地点|活动内容|快来领取|分享你喜欢的|一起来分享吧|免费领取|活动如下：|活动请关注|关注最新活动|免费试用|线上专供|报名网址|本次活动|活动开始|红包大派送|众多好礼|拿大奖|免费大派发|踊跃投票|欢迎\D{0,1}报名参加|大力支持|活动二|小编注意到|立即申请|即可参与抽奖|敬请期待|有机会赢|有奖竞猜|详情(请)*点击|活动热线|现在就来参加|只要分享|就有机会获得|微博抽奖|获得好礼|即可赢得|有机会获得|获奖名单|就有机会中奖|赢取|即可获赠|礼品等着您|圆满落幕|有机会赢得|报名活动|幸运奖品|活动最后一天|赢取大奖|活动将送|店庆|有机会获得|活动内容详见|等你来挑战|即日起，"),
    ("科普", "(①|②|③|1\.|2\.|1\、|2\、|图1|图2|1\）| 2\）|一\、|二\、|三\、)|情感好文|今天就介绍大家|今天就介绍给大家|最新发现|研究指出|数据证明|研究发现|注意事项|小贴士|本款|分享给大家|请关注@|小编给大家推荐"),
    ("新闻", "据媒体报道|开幕首日|隆重举行|活动现场|启动仪式|商业活动中|娱乐|日发售"),
    ("灌水", "顶上去|66666|牛牛牛|顶一个"),
    ("分享", "转走|转载|转发|成功分享到|大家帮忙多转|豪礼|一张图片测试|性格测试题|很火的心理测试|您敢挑战吗|异性眼中的你|招聘测试题|变态测试题|请朋友们留意|原文地址|看客推荐|让你在人群中|别怪我不告诉你|转发此条微博|详情点击|分享一款|供大家参考|给大家分享我|小说|转发此微博|分享赢|最变态招聘测试题"),
    ("其他", "此用户暂时被停用|宜忌")
]


for line in sys.stdin:
    line = smart_decode(line).replace("\n", "").replace("\r", "").replace("\\N", "").split("\t")
    try:
        id, channel, subject, post_id, title, tags, reply_count, view_count, collection_count, detail_url, content, is_best_answer, like_count, user_id, user_name, user_type, is_host, replied_user_id, replied_user_name, created_at, device, updated_at, baby_agethen, baby_days, floorid, noise, platform_id = line
        noise = mother_baby_denoise(content, l)
        print(smart_encode("\t".join([id, channel, subject, post_id, title, tags, reply_count, view_count, collection_count, detail_url, content, is_best_answer, like_count, user_id, user_name, user_type, is_host, replied_user_id, replied_user_name, created_at, device, updated_at, baby_agethen, baby_days, floorid, noise, platform_id])))
    except Exception as e:
        print(smart_encode(traceback.format_exc().replace("\t", " ").replace("\n", " ")))
